Revit 2026 API

# PanelScheduleType Enumeration

---

This enum declares the panel schedule type.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum PanelScheduleType
```
```vb
Public Enumeration PanelScheduleType
```
```cpp
public enum class PanelScheduleType
```
```fsharp
type PanelScheduleType
```

| Member name | Value | Description |
| --- | --- | --- |
| Branch | 0 | Branch panel schedule |
| Data | 2 | Data panel schedule |
| Switchboard | 1 | Switchboard schedule |
| Unknown | -1 | Unknown panel schedule |

#### Reference

Autodesk.Revit.DB.Electrical Namespace